<?php
// session_start();
// $_SESSION['flash'][] = 'cooбщение 1';
// header('Location:action_2.php');
?>

<?php
// if(!isset($_GET['num'])) {
//     header('Location:action.php?num=1');
// }
// echo $_GET['num'];
?>

<?php
// header('location:index.php?success=1');
?>

<!-- Сделайте теперь страницу action.php. Пусть при заходе на эту страницу выполняется редирект на страницу index.php из предыдущей задачи. При редиректе передайте в GET параметре success значение 1. -->


<!-- Пусть на странице action.php можно передать число с помощью GET параметра с именем num. Сделайте так, чтобы при заходе без данного параметра, автоматически выполнялся редирект на эту же страницу, но с параметром num в значении 1. -->


<!-- Реализуйте описанные флеш сообщения. Проверьте их работу. -->