<!-- Найдите сумму всех его элементов. -->
<?php
$arr = [[1, 2], [3, 4], [5, 6]];
echo $sum = $arr[0][0] + $arr[0][1] + $arr[1][0] + $arr[1][1] + $arr[2][0] + $arr[2][1];
?>

</br>
</br>
<!-- Найдите сумму всех элементов приведенного массива. -->

<?php
	$arr = [
		[
			[1, 2],
			[3, 4],
		],
		[
			[5, 6],
			[7, 8],
		],
	];

    echo $sum = $arr[0][0][0] + $arr[0][0][1] + $arr[0][1][0] + $arr[0][1][1] + $arr[1][0][0] + $arr[1][0][1] + $arr[1][1][0] + $arr[1][1][1];
?>

</br>
</br>
<!-- Выведите с помощью этого массива сумму зарплат первого и третьего юзера. -->
<?php
	$arr = [
		[
			'name'   => 'user1',
			'age'    => 30,
			'salary' => 1000,
		],
		[
			'name'   => 'user2',
			'age'    => 31,
			'salary' => 2000,
		],
		[
			'name'   => 'user3',
			'age'    => 32,
			'salary' => 3000,
		],
	];

    echo $sum = $arr[0]['salary'] . ", " . $arr[2]['salary'];
?>


</br>
</br>
<!-- Найдите сумму всех элементов приведенного массива. Обращайтесь к каждому элементу по отдельности, без цикла. -->

<?php
	$arr = [[1, 2, 3, [4, 5, [6, 7]]], [8, [9, 10]]];

    echo $sum = $arr[0][0] + $arr[0][1] + $arr[0][2] + $arr[0][3][0] + $arr[0][3][1] + $arr[0][3][2][0] + $arr[0][3][2][1] + $arr[1][0] + $arr[1][1][0] + $arr[1][1][1];
?>

</br>
</br>
<!-- 
С помощью двух вложенных циклов найдите сумму элементов этого массива. -->
<?php
	$arr = [[1, 2, 3], [4, 5, 6, 7], [8, 9]];
    $sum = 0;
    foreach($arr as $elem1) {
        
        foreach($elem1 as $elem2) {
            $sum += $elem2;
        }
     
    }
    echo $sum;
?>

</br>
</br>
<!-- 
С помощью двух вложенных циклов найдите сумму элементов этого массива. -->
<?php
		$arr = [
            [
                [1, 2, 3],
                [6, 7, 8],
                [3, 8, 4],
                [6, 7, 9],
            ],
            [
                [9, 1, 2],
                [4, 5, 6],
            ],
            [
                [9, 1, 2],
                [4, 5, 6],
                [5, 6, 3],
            ],
        ];
    $sum = 0;
    foreach($arr as $elem1) {
        
        foreach($elem1 as $elem2) {
            foreach($elem2 as $elem3) {
                $sum += $elem3;
            }
        }
     
    }
    echo $sum;
?>

</br>
</br>
<!-- Выведите элементы этого массива в формате ключ-значение. -->
<?php
	$arr = [
		[
			'name'   => 'user1',
			'age'    => 30,
			'salary' => 1000,
		],
		[
			'name'   => 'user2',
			'age'    => 31,
			'salary' => 2000,
		],
		[
			'name'   => 'user3',
			'age'    => 32,
			'salary' => 3000,
		],
	];

    foreach($arr as $key1 => $elem1) {
        foreach($elem1 as $key2 => $elem2) {
            echo $key2 . "-" . $elem2 . " ";
        }
    }
?>


</br>
</br>
<!-- С помощью двух вложенных циклов выведите элементы этого массива в формате имя группы - имя юзера. -->
<?php
	$arr = [
		'group1'  => ['user11', 'user12', 'user13', 'user43'],
		'group2'  => ['user21', 'user22', 'user23'],
		'group3'  => ['user31', 'user32', 'user33'],
		'group4'  => ['user41', 'user42', 'user43'],
		'group5'  => ['user51', 'user52'],
	];

    foreach($arr as $key1 => $elem1) {
        foreach($elem1 as $elem2) {
            echo $key1 . "-" . $elem2 . " ";
        };
        echo '</br>';
    }
?>

</br>
</br>
<!--Сформируйте с помощью двух вложенных циклов следующий массив:
[[1, 2, 3, 4, 5], [1, 2, 3, 4, 5], [1, 2, 3, 4, 5]] -->
<?php

$arr = [];
for($i = 0; $i < 3; $i++) {
    for($j = 0; $j < 5; $j++) {
        $arr[$i][$j] = $j + 1;
    }
}
var_dump($arr);
?>


</br>
</br>
<!-- Сформируйте с помощью двух вложенных циклов следующий массив:
[['x', 'x', 'x', 'x'], ['x', 'x', 'x', 'x'], ['x', 'x', 'x', 'x']] -->

<?php

$arr = [];
for($i = 0; $i < 3; $i++) {
    for($j = 0; $j < 4; $j++) {
        $arr[$i][$j] = "x";
    }
}
var_dump($arr);
?>


</br>
</br>
<!-- Сформируйте с помощью трех вложенных циклов следующий массив:

[
	[
		[1, 2, 3, 4, 5],
		[1, 2, 3, 4, 5],
	],
	[
		[1, 2, 3, 4, 5],
		[1, 2, 3, 4, 5],
	],
	[
		[1, 2, 3, 4, 5],
		[1, 2, 3, 4, 5],
	],
] -->

<?php

$arr = [];
for($i = 0; $i < 3; $i++) {
    for($j = 0; $j < 2; $j++) {
        for($k = 0; $k < 5; $k++) {
            $arr[$i][$j][$k] = $k + 1; 
        }
    }
}
var_dump($arr);
?>


</br>
</br>
<!-- Сформируйте с помощью двух вложенных циклов следующий массив:
	[[1, 2], [3, 4], [5, 6], [7, 8]]
 -->
<?php
$arr = [];

for($i = 0, $k = 1; $i < 4; $i++) {
    for($j = 0; $j < 2; $j++, $k++) {
        $arr[$i][$j] = $k;
      
    }
}
var_dump($arr);
?>


</br>
</br>
<!-- Задача 5⋕pp.Pm.Md.MAF.5

Сформируйте с помощью двух вложенных циклов следующий массив:
	[[2, 4, 6], [8, 10, 12], [14, 16, 18], [20, 22, 24]]-->

    <?php
$arr = [];

for($i = 0, $k = 2; $i < 4; $i++) {
    for($j = 0; $j < 3; $j++, $k++) {
        $arr[$i][$j] = $k++;
    }
}
var_dump($arr);
?>


</br>
</br>
<!-- Сформируйте с помощью трех вложенных циклов следующий трехмерный массив:
	[[[1, 2], [3, 4]], [[5, 6], [7, 8]]]
-->
<?php
$arr = [];
$num = 1;
for($i = 0; $i < 2; $i++) {
    for($j = 0; $j < 2; $j++) {
        for($k = 0; $k < 2; $k++) {
            $arr[$i][$j][$k] = $num;
            $num++;
        }
    }
}
var_dump($arr);

?>

</br>
</br>
<!-- Выведите с помощью этого массива столбец продуктов в каком-нибудь придуманном вами формате. -->


<?php
$products = [
    [
        'name'   => 'мясо',
        'price'  => 100,
        'amount' => 5,
    ],
    [
        'name'   => 'овощи',
        'price'  => 200,
        'amount' => 6,
    ],
    [
        'name'   => 'фрукты',
        'price'  => 300,
        'amount' => 7,
    ],
];
foreach($products as $elem) {
    echo $elem['name'] . "-" . $elem['price'] . "-" . $elem['amount'] . "</br>";  
}
?>

</br>
</br>
<!-- Добавьте в массив с продуктами из предыдущей задачи еще один продукт.

	$users[] = [
		'name'   => 'name4',
		'age'    => 34,
		'salary' => 4000,
	];
-->

<?php
$products = [
    [
        'name'   => 'мясо',
        'price'  => 100,
        'amount' => 5,
    ],
    [
        'name'   => 'овощи',
        'price'  => 200,
        'amount' => 6,
    ],
    [
        'name'   => 'фрукты',
        'price'  => 300,
        'amount' => 7,
    ],
];

$products[] = [
    'name'   => 'одежда',
    'price'    => 3400,
    'amount' => 40,
];


foreach($products as $elem) {
    echo $elem['name'] . "-" . $elem['price'] . "-" . $elem['amount'] . "</br>";  
}
?>


</br>
</br>
<!-- Дан список городов и их стран, хранящийся в следующей структуре:

[
	[
		'country' => 'Россия',
		'city' =>    'Москва',
	],
	[
		'country' => 'Беларусь',
		'city' =>    'Минск',
	],
	[
		'country' => 'Россия',
		'city' =>    'Питер',
	],
	[
		'country' => 'Россия',
		'city' =>    'Владивосток',
	],
	[
		'country' => 'Украина',
		'city' =>    'Львов',
	],
	[
		'country' => 'Беларусь',
		'city' =>    'Могилев',
	],
	[
		'country' => 'Украина',
		'city' =>    'Киев',
	],
] 
Напишите код, которой переделает структуру данных вот в такую:

[
	'Россия'=> [
		'Москва', 'Питер', 'Владивосток',
	],
	'Беларусь'=> [
		'Минск', 'Могилев'
	],
	'Украина'=> [
		'Киев', 'Львов'
	],
] -->

<?php
$arr = [
	[
		'country' => 'Россия',
		'city' =>    'Москва',
	],
	[
		'country' => 'Беларусь',
		'city' =>    'Минск',
	],
	[
		'country' => 'Россия',
		'city' =>    'Питер',
	],
	[
		'country' => 'Россия',
		'city' =>    'Владивосток',
	],
	[
		'country' => 'Украина',
		'city' =>    'Львов',
	],
	[
		'country' => 'Беларусь',
		'city' =>    'Могилев',
	],
	[
		'country' => 'Украина',
		'city' =>    'Киев',
	],
];

$arr2 =[];
$k = [];
foreach($arr as $elem) {
      $arr2[$elem['country']][] =  $elem['city'];    
}
var_dump($arr2);
?>





</br>
</br>
<!-- Дан список событий за определенные даты, хранящийся в следующей структуре:

[
	[
		'date'  => '2019-12-29',
		'event' => 'name1'
	],
	[
		'date'  => '2019-12-31',
		'event' => 'name2'
	],
	[
		'date'  => '2019-12-29',
		'event' => 'name3'
	],
	[
		'date'  => '2019-12-30',
		'event' => 'name4'
	],
	[
		'date'  => '2019-12-29',
		'event' => 'name5'
	],
	[
		'date'  => '2019-12-31',
		'event' => 'name6'
	],
	[
		'date'  => '2019-12-29',
		'event' => 'name7'
	],
	[
		'date'  => '2019-12-30',
		'event' => 'name8'
	],
	[
		'date'  => '2019-12-30',
		'event' => 'name9'
	],
]
Напишите код, которой переделает структуру данных вот в такую:

[
	'2019-12-29'=> ['name1', 'name3', 'name5', 'name7'],
	'2019-12-30'=> ['name4', 'name8', 'name9'],
	'2019-12-31'=> ['name2', 'name6'],
] -->
<?php
$arr = [
	[
		'date'  => '2019-12-29',
		'event' => 'name1'
	],
	[
		'date'  => '2019-12-31',
		'event' => 'name2'
	],
	[
		'date'  => '2019-12-29',
		'event' => 'name3'
	],
	[
		'date'  => '2019-12-30',
		'event' => 'name4'
	],
	[
		'date'  => '2019-12-29',
		'event' => 'name5'
	],
	[
		'date'  => '2019-12-31',
		'event' => 'name6'
	],
	[
		'date'  => '2019-12-29',
		'event' => 'name7'
	],
	[
		'date'  => '2019-12-30',
		'event' => 'name8'
	],
	[
		'date'  => '2019-12-30',
		'event' => 'name9'
	],
];

$arr2 = [];
foreach($arr as $elem) {
    $arr2[$elem['date']][] = $elem['event'];
}
var_dump($arr2);
?>




</br>
</br>
<!-- 
    Дан список событий за определенные даты, хранящийся в следующей структуре:

[
	'2019-12-29'=> ['name1', 'name2', 'name3', 'name4'],
	'2019-12-30'=> ['name5', 'name6', 'name7'],
	'2019-12-31'=> ['name8', 'name9'],
]
Напишите код, которой переделает структуру данных вот в такую:

[
	[
		'date'  => '2019-12-29',
		'event' => 'name1'
	],
	[
		'date'  => '2019-12-29',
		'event' => 'name2'
	],
	[
		'date'  => '2019-12-29',
		'event' => 'name3'
	],
	[
		'date'  => '2019-12-29',
		'event' => 'name4'
	],
	[
		'date'  => '2019-12-30',
		'event' => 'name5'
	],
	[
		'date'  => '2019-12-30',
		'event' => 'name6'
	],
	[
		'date'  => '2019-12-30',
		'event' => 'name7'
	],
	[
		'date'  => '2019-12-31',
		'event' => 'name8'
	],
	[
		'date'  => '2019-12-31',
		'event' => 'name9'
	],
]
 -->
 <?php

$arr = [
	'2019-12-29'=> ['name1', 'name2', 'name3', 'name4'],
	'2019-12-30'=> ['name5', 'name6', 'name7'],
	'2019-12-31'=> ['name8', 'name9'],
];

 $arr2 =[];

//  foreach($arr as $elem) {
//     $arr2[$elem['date']][] = $elem['event'];

foreach($arr as $key => $elem) {
    foreach($elem as $elem2) {
       $arr2[] = [ 
        'date' => $key,
        'event' => $elem2
    ];
    }

    
}

var_dump($arr2);
?>