<!-- Найдите сумму всех его элементов. -->
<?php
$arr = [[1, 2], [3, 4], [5, 6]];
echo $sum = $arr[0][0] + $arr[0][1] + $arr[1][0] + $arr[1][1] + $arr[2][0] + $arr[2][1];
?>

</br>
</br>
<!-- Найдите сумму всех элементов приведенного массива. -->

<?php
	$arr = [
		[
			[1, 2],
			[3, 4],
		],
		[
			[5, 6],
			[7, 8],
		],
	];

    echo $sum = $arr[0][0][0] + $arr[0][0][1] + $arr[0][1][0] + $arr[0][1][1] + $arr[1][0][0] + $arr[1][0][1] + $arr[1][1][0] + $arr[1][1][1];
?>

</br>
</br>
<!-- Выведите с помощью этого массива сумму зарплат первого и третьего юзера. -->
<?php
	$arr = [
		[
			'name'   => 'user1',
			'age'    => 30,
			'salary' => 1000,
		],
		[
			'name'   => 'user2',
			'age'    => 31,
			'salary' => 2000,
		],
		[
			'name'   => 'user3',
			'age'    => 32,
			'salary' => 3000,
		],
	];

    echo $sum = $arr[0]['salary'] . ", " . $arr[2]['salary'];
?>


</br>
</br>
<!-- Найдите сумму всех элементов приведенного массива. Обращайтесь к каждому элементу по отдельности, без цикла. -->

<?php
	$arr = [[1, 2, 3, [4, 5, [6, 7]]], [8, [9, 10]]];

    echo $sum = $arr[0][0] + $arr[0][1] + $arr[0][2] + $arr[0][3][0] + $arr[0][3][1] + $arr[0][3][2][0] + $arr[0][3][2][1] + $arr[1][0] + $arr[1][1][0] + $arr[1][1][1];
?>

</br>
</br>
<!-- 
С помощью двух вложенных циклов найдите сумму элементов этого массива. -->
<?php
	$arr = [[1, 2, 3], [4, 5, 6, 7], [8, 9]];
    $sum = 0;
    foreach($arr as $elem1) {
        
        foreach($elem1 as $elem2) {
            $sum += $elem2;
        }
     
    }
    echo $sum;
?>

</br>
</br>
<!-- 
С помощью двух вложенных циклов найдите сумму элементов этого массива. -->
<?php
		$arr = [
            [
                [1, 2, 3],
                [6, 7, 8],
                [3, 8, 4],
                [6, 7, 9],
            ],
            [
                [9, 1, 2],
                [4, 5, 6],
            ],
            [
                [9, 1, 2],
                [4, 5, 6],
                [5, 6, 3],
            ],
        ];
    $sum = 0;
    foreach($arr as $elem1) {
        
        foreach($elem1 as $elem2) {
            foreach($elem2 as $elem3) {
                $sum += $elem3;
            }
        }
     
    }
    echo $sum;
?>

</br>
</br>
<!-- Выведите элементы этого массива в формате ключ-значение. -->
<?php
	$arr = [
		[
			'name'   => 'user1',
			'age'    => 30,
			'salary' => 1000,
		],
		[
			'name'   => 'user2',
			'age'    => 31,
			'salary' => 2000,
		],
		[
			'name'   => 'user3',
			'age'    => 32,
			'salary' => 3000,
		],
	];

    foreach($arr as $key1 => $elem1) {
        foreach($elem1 as $key2 => $elem2) {
            echo $key2 . "-" . $elem2 . " ";
        }
    }
?>


</br>
</br>
<!-- С помощью двух вложенных циклов выведите элементы этого массива в формате имя группы - имя юзера. -->
<?php
	$arr = [
		'group1'  => ['user11', 'user12', 'user13', 'user43'],
		'group2'  => ['user21', 'user22', 'user23'],
		'group3'  => ['user31', 'user32', 'user33'],
		'group4'  => ['user41', 'user42', 'user43'],
		'group5'  => ['user51', 'user52'],
	];

    foreach($arr as $key1 => $elem1) {
        foreach($elem1 as $elem2) {
            echo $key1 . "-" . $elem2 . " ";
        };
        echo '</br>';
    }
?>

</br>
</br>
<!--Сформируйте с помощью двух вложенных циклов следующий массив:
[[1, 2, 3, 4, 5], [1, 2, 3, 4, 5], [1, 2, 3, 4, 5]] -->
<?php

$arr = [];
for($i = 0; $i < 3; $i++) {
    for($j = 0; $j < 5; $j++) {
        $arr[$i][$j] = $j + 1;
    }
}
var_dump($arr);
?>


</br>
</br>
<!-- Сформируйте с помощью двух вложенных циклов следующий массив:
[['x', 'x', 'x', 'x'], ['x', 'x', 'x', 'x'], ['x', 'x', 'x', 'x']] -->

<?php

$arr = [];
for($i = 0; $i < 3; $i++) {
    for($j = 0; $j < 4; $j++) {
        $arr[$i][$j] = "x";
    }
}
var_dump($arr);
?>